<?php

return [
    'image' => [
        'required' => 'حقل الصورة مطلوب.',
        'file' => 'يجب أن يكون الملف من نوع ملف.',
        'mimes' => 'يجب أن يكون الملف من الأنواع: jpeg, png, jpg, gif, svg.',
        'max' => 'لا يمكن أن يتجاوز حجم الصورة 2048 كيلوبايت.',
    ],
    'welcome_notification' => '🎉 تهانينا! تم قبولك رسميًا في منصة ميدنوفا. نرحب بك في مجتمعنا ونتطلع لتجربتك معنا!',
    'rejected_notification' => '⚠️ نأسف لإبلاغك أن طلبك لم يتم قبوله في منصة ميدنوفا في الوقت الحالي. يمكنك مراجعة سبب الرفض والتواصل معنا لمزيد من المعلومات. نشكرك على اهتمامك ونتمنى لك التوفيق.',
    'approval_status' => 'حالة الاعتماد ' ,
    'reason' => 'السبب' ,
    'CANNOT_REJECT_APPROVED_ACCOUNT' => 'لا يمكن رفض الحساب بعد اعتماده. يمكنك حظر الحساب أو إيقافه بدلاً من ذلك.',
    'CUSTOMER_CANNOT_BE_DELETED_HAS_ACTIVE_RELATIONS' => 'لا يمكن حذف هذا الحساب لأنه يحتوي على استشارات أو بيانات مرتبطة نشطة.',
    'PROGRAM_ALREADY_APPROVED' => 'البرنامج تم اعتماده مسبقاً.',
    'PROGRAM_ALREADY_REJECTED' => 'البرنامج تم رفضه مسبقاً.',
    'PROGRAM_APPROVED_SUCCESSFULLY' => 'البرنامج تم اعتماده بنجاح ',
    'NO_CONSULTATION_ALLOWED' => 'لا يمكن قبول الاستشارة لأن موعدها قد انتهى',

    'CANNOT_APPROVE_ARCHIVED_PROGRAM' => 'لا يمكن اعتماد برنامج مؤرشف.',

    'APPROVED_PROGRAM_CANNOT_BE_REJECTED' => 'لا يمكن رفض برنامج تم اعتماده.',

    'PROGRAM_NOT_READY_FOR_APPROVAL' => 'البرنامج غير جاهز للاعتماد. يرجى استكمال جميع البيانات المطلوبة قبل طلب الاعتماد.',

    'PROGRAM_REJECTED_SUCCESSFULLY' => 'تم رفض البرنامج بنجاح.',

    'INVALID_STATUS_TRANSITION' => 'لا يمكن تغيير حالة البرنامج إلى الحالة المطلوبة.',

    'REJECTION_REASON_REQUIRED' => 'سبب الرفض مطلوب.',
    'CANNOT_APPROVE_DRAFT_PROGRAM' => 'لا يمكن اعتماد برنامج بحالة مسودة. يجب نشره أولاً.',
    'CUSTOMER_BLOCKED' => 'تم حظر حساب العميل بنجاح.',
    'CUSTOMER_UNBLOCKED' => 'تم رفع الحظر عن حساب العميل بنجاح.',
    'CUSTOMER_NOT_FOUND' => 'العميل غير موجود.',
    'INVALID_STATUS' => 'قيمة الحالة غير صالحة.',
    'CANNOT_APPROVE_BLOCKED' => 'لا يمكن اعتماد حساب محظور.',
    'PROFILE_NOT_COMPLETED' => 'لا يمكن اعتماد الحساب. الملف الشخصي غير مكتمل.',
    'correct_answer_media.required' => 'وسائط تحديد الاجابة الصحيحة مطلوب' ,
    'wrong_answer_media.required' =>'وسائط تحديد الاجابة الخاطئة مطلوب' ,
    'exercise_send' => ' لقد تم ارسال امر تمرين بنجاح نتظر استجابة القفاز ',
    'send_command' => 'عملية ارسال الامر تحت معالجة ',
    'send_command_failed' => 'فشل في ارسال الامر لجهاز حاول مرة اخرى ',
    'send_command_success' => 'تم ارسال الامر ننتظر حدوث  استجابة من الجهاز ' ,
    'python_unreachable' => ' يوجد مشكلة في  ارسال الامر حاول مرة اخرى ' ,
    'connection_not_active' => 'لا يوجد اقتران بينك وبين القفاز  حاول الاقتران مرة اخرى ',
    'no_glove_data' => 'لا يوجد مؤشرات حيوية تابعة لمستخدم يوجد مشكلة في اقتران حاول مرة اخرى',
    // رسائل المالك (admin)
    'name.required' => 'الاسم مطلوب.',
    'name.string' => 'الاسم يجب أن يكون نصًا.',
    'name.max' => 'الاسم لا يجب أن يتجاوز 255 حرفًا.',
    'format_code' => 'يجب أن تكون القيمة بتنسيق + متبوعة برقم واحد أو أكثر (على سبيل المثال، "+2"، "+970").' ,
    'Not_IS_EMPTY' => 'لا يجب ان تكون القيمة فارغة ',
    'NO_IDS_PROVIDED' => 'لا يوجد معرفات متوفرة ' ,
    'device_not_found'=>'بيانات الجهاز القفاز الذكي غير موجودة ',
    'invalid_sender' => 'المرسل غير مرتبط بهذه الاستشارة.' ,
    'invalid_receiver' => 'المستقبل المحدد لا يتطابق مع بيانات الاستشارة.' ,
    'invalid_send' => 'غير مسموح ارسال مسج لمحادثة غير نشطة او مقبولة ' ,
    'approved_consultation_success' =>  'تم اعتماد طلب الاستشارة من قبل احد المشاركين ' ,
    'successful_create_payment_link'=>'تم إنشاء رابط بوابة الدفع بنجاح.' ,
    'failed_to_initialize' => 'فشل في التهيئة رابط بوابة دفع من خلال بوابة اموال باي ' ,
    'RESOURCE_NOT_FOUND' => 'لم يتم العثور على البيانات المطلوبة.',


    'consultation_pending'  => 'لديك طلب استشارة مع هذا المستشار قيد الانتظار.',
    'consultation_accepted' => 'تم قبول استشارتك مع المستشار  يرجى التواصل معه.',
    'consultation_active'   => 'لديك استشارة نشطة حالياً مع المستشار .',


    'INVALID_LEVEL'=> 'مستوى غير صالح',
    'EXPIRED_TIME'=> 'انتهى وقت الانتظار حاول مرة اخرى ' ,
    'NO_GAMES' => 'لم يتم العثور على ألعاب لهذا المستخدم',
    'delete_friend_request' => 'تم حذف  طلب الصداقة' ,
    'accept_friend_request' => 'تم قبول طلب الصداقة' ,
    'TRAFFICKER_SUCCESSFULLY' => 'تم إكمال عملية التتبع. ',
    'successful_capture_data_via_webhook'  =>'تم استقبال بيانات  من اموال باي خاص في حركات المالية بنجاح ',
    'NOTIFICATION_SENT_SUCCESSFULLY'=> 'تم ارسال الاشعار بنجاح ' ,
    'GAME_END' =>'لقد تم الانتهاء من اللعبة.' ,
    'FINANCIA_GET_SUCCESSFULLY' => 'تمت عملية الحصول على بيانات المالية',
    'DATA_RETRIEVED_SUCCESSFULLY' => ' . تم استرجاع البيانات بنجاح',
    'DATA_RETRIEVED_FAILD' => ' . فشل في استرجاع البيانات ',
    'PURCHASES_ORDER_ITEMS_RETRIEVED' => 'تم استرجاع مشتريات الطلبية ' ,
    'PAYMENTS_ORDER_RETRIEVED' => 'تم استرجاع  دفعات  الطلبية ' ,
    'ATTACHMENTS_ORDER_DETAILS_RETRIEVED'  => 'تم استرجاع   مرفقات   الطلبية '  ,
    'UPDATES_ORDER_DETAILS_RETRIEVED'  => 'تم استرجاع   تحديثات   الطلبية '  ,
    'UPDATES_ORDER_NOT_FOUND' => 'لا يمكننا العثور على هذا   تحديثات  الطلبية ' ,
    'CREATE_ITEM_SUCCESSFULLY' => ' تم انشاء العنصر بنجاح ' ,
    'CREATE_FRIEND_REQUEST_SUCCESSFULLY' => ' تم ارسال طلب الصداقة ' ,
    'UPDATE_STATUS_USER_ACTIVE' => 'تم تحديث على حالة نشاط المستخدم ',
    'STORE_SCORE_SUCCESSFULLY' => 'تم تخزين النتيجة '  ,

    'DELETE_ITEM_SUCCESSFULLY' => ' تم حذف  العنصر بنجاح ' ,
    'CREATE_ITEM_FAILD' => 'فشل في عملية الانشاء العنصر ' ,
    'DELETE_ITEM_FAILD' => 'فشل في عملية حذف العنصر ' ,
    'UPDATE_ELEMENT_NOT_FOUND' => 'فشل في تحديث يجب عليك ادخال البيانات التي تريد تحديثها ' ,
    'INVOICES_ORDER_DETAILS_RETRIEVED' => 'تم إرجاع فواتير الطلب.' ,
    'INVOICES_ORDER_NOT_FOUND' => 'لم يتم العثور على بيانات الفواتير لهذا الطلب.' ,
    'VETIFICATION_ERRORS'  => 'يوجد خطأ في البيانات المدخلة ',
    'ORDERS_RETRIEVED' => '  تم استرجاع بيانات الطلبيات ' ,
    'ORDERS_NOT_FOUND' => 'لم يتم العثور على الطلبيات  ' ,
    "INVALID_TOKEN"=>'رمز أو مستخدم غير صالح.' ,
    "PASSWORD_RESET_SUCCESFULL"=>'تم إعادة تعيين كلمة المرور بنجاح.' ,
    'EMAIL_VERIFICATION_SUCCESSFUL'=> 'تحقق من البريد الاكتروني تمت بشكل صحيح ',
    'EMAIL_PRE_VERIFIED'=> 'تم التحقق مسبقًا من البريد الاكتروني ',
    'EMAIL_NOT_VERIFIED' => 'يرجى تأكيد عنوان بريدك الإلكتروني قبل المتابعة.' ,

    'glove_pairing_failed' => 'حدث خطأ أثناء عملية الاقتران بالقفاز. يرجى المحاولة مرة أخرى.',

    // AUTH
    'ITEMS_UPDATED_SUCCESSFULLY' => 'تم تحديث العناصر بنجاح.',
    'INVALID_DELIVERED_QUANTITY' => 'يجب ألا تكون الكمية المسلمة أكبر من الكمية الإجمالية.',
    'EXCEPTION_MESSAGE' => 'حدث خطأ: :message',
    'ORDER_STATUS_UPDATED' => 'تم تحديث الحالة لطلبية ',
    'INVALID_UPDATE_ELEMENT' =>   'عنصر التحديث غير صالح'  ,
    "PASSWORD_RESET_LINK_SEND"=>'تم إرسال رابط إعادة تعيين كلمة المرور.'  ,
    'REGISTERED_SUCCESSFULLY' => 'تم إنشاء الحساب بنجاح',
    'BLOCKED_DEVICE' => 'الحساب محظور',
    'REGISTRATION_CLOSED' => 'التسجيل مغلق من قبل مسؤول النظام',
    'AUTH_CODE_ERROR' => 'خطأ في رمز التفعيل، حاول مرة أخرى',
    'AUTH_CODE_SENT_BEFORE' => 'تم إرسال رمز التفعيل مسبقًا، الرجاء التحقق من رسائلك!',
    'NO_AUTH_CODE' => 'تم رفض العملية، الرمز غير صحيح',
    'UNAUTHORISED' => 'غير مصرح، الرجاء تسجيل الدخول',
    'IN_ACTIVE_ACCOUNT' => 'يرجى تفعيل حسابك، تحقق من رسائلك',
    'ERROR_CREDENTIALS' => 'خطأ في بيانات تسجيل الدخول، تحقق وحاول مرة أخرى',
    'LOGGED_OUT_SUCCESSFULLY' => 'تم تسجيل الخروج بنجاح',
    'LOGGED_IN_SUCCESSFULLY' => 'تم تسجيل الدخول بنجاح',
    'LOGIN_IN_FAILED' => 'فشل في تسجيل الدخول، حاول مرة أخرى!',
    'NO_ACCOUNT' => 'رقم الهاتف غير مسجل!',
    'AUTH_CODE_SENT' => 'تم إرسال رمز التفعيل بنجاح',
    'ACCOUNT_EXIST' => 'البريد الإلكتروني مسجل مسبقًا!',
    'MOBILE_EXIST' => 'رقم الهاتف مسجل مسبقًا!',
    'SUCCESS_AUTH' => 'تم تفعيل الحساب بنجاح',
    'exam_fail' => 'نعتذر، لم تتمكن من اجتياز الاختبار',
    'attempts' => 'لقد تجاوزت عدد المحاولات المسموح بها',
    'profile_exam' => 'يرجى إكمال ملفك الشخصي',
    'ITEM_NOT_FOUND' => 'لا يمكننا العثور على هذا السجل',
    'SEND_FAILED' => 'لقد تم الإرسال مسبقًا',
    'BASKET_IS_EMPTY' => 'سلة التسوق فارغة',
    'INVALIDE_SERVICE_TYPE'  => 'نوع الخدمة غير صالح' ,
    'INTERNAL_SERVER_ERROR'  => 'خطأ في الخادم الداخلي'  ,
    'PURCHASES_ORDER_ITEMS_NOT_FOUND' =>  ' لا يمكن العثور على بيانات المشتريات في هذه الطلبية' ,
    'PAYMENTS_ORDER_NOT_FOUND' => ' لا يمكن العثور على بيانات الدفعات   في هذه الطلبية'  ,
    'ERROR_FCM_TOKEN'=> 'لا يمتلك المستخدم رمز جهاز' ,
    'NO_DATA' => ' لا يوجد بيانات ' ,
    'TOKEN_EXPIRED'=> 'انتهت صلاحية الكود. حاول مرة أخرى لاحقًا.' ,
    'FORGET_PASSWORD_SUCCESS' => 'تم إرسال رمز إعادة تعيين كلمة المرور بنجاح',
    'FORGET_PASSWORD_FAILED' => 'فشل في إرسال رمز إعادة تعيين كلمة المرور!',
    'PASSWORD_RESET_CODE_CORRECT' => 'رمز إعادة تعيين كلمة المرور صحيح، قم بتعيين كلمة مرور جديدة',
    'PASSWORD_RESET_CODE_ERROR' => 'خطأ في رمز إعادة تعيين كلمة المرور، حاول مرة أخرى',
    'NO_PASSWORD_RESET_CODE' => 'لا يوجد طلب لإعادة تعيين كلمة المرور، تم رفض العملية!',
    'PASS_RESET_CODE_SENT_BEFORE' => 'تم إرسال رمز إعادة تعيين كلمة المرور مسبقًا، تحقق من رسائلك!',
    'exp_date' => 'انتهت صلاحية هذا الاختبار',
    'ID_NOT_FOUND' => 'لم يتم العثور على المعرف المحدد.',
    'PROFILE_UPDATED_SUCCESSFULLY' => 'تحديث بيانات البروفايل بنجاح  '  ,
    'RESET_PASSWORD_SUCCESS' => 'تم إعادة تعيين كلمة المرور بنجاح',
    'RESET_PASSWORD_FAILED' => 'فشل في إعادة تعيين كلمة المرور!',
    'CART_SUCCESS' => 'تمت الإضافة إلى السلة بنجاح',
    'UNAUTHENTICATED'=> 'غير مصادق عليه ' ,
    'CONTACT_US_REQUEST_SUCCESS' => 'تم إرسال طلب الاتصال بنجاح، شكرًا لك',
    'CONTACT_US_REQUEST_FAILED' => 'فشل في إرسال طلب الاتصال، حاول مرة أخرى',

    'USER_UPDATED_SUCCESS' => 'تم تحديث الملف الشخصي بنجاح',
    'USER_UPDATED_FAILED' => 'فشل في تحديث الملف الشخصي، حاول مرة أخرى',

    'PASSWORD_SENT' => 'تم إرسال كلمة المرور بنجاح، استخدمها لتسجيل الدخول إلى حسابك',
    'PASSWORD_SEND_FAILED' => 'فشل في إرسال كلمة المرور، حاول مرة أخرى',
    'PASSWORD_ALREADY_SET' => 'تم تعيين كلمة المرور مسبقًا!',
    'PASSWORD_NOT_SET' => 'يرجى طلب كلمة مرور حسابك!',

    'MULTI_ACCESS_ERROR' => 'لا يمكن تسجيل الدخول إلى نفس الحساب من جهازين في آن واحد!',
    'SECURITY_CHECK_SUCCESS' => 'تم إرسال حالتك بنجاح، كن آمنًا',
    'SECURITY_CHECK_DUPLICATE' => 'تم إرسال حالتك مسبقًا، كن آمنًا',
    'SECURITY_CHECK_FAILED' => 'حدث خطأ في إرسال حالتك، حاول مرة أخرى',
    'CREATE_USER_SUCCESSFULLY' => 'تم انشاء الحساب بنجاح ' ,
    'PAGE_TRANSLATED_SUCCESS' => 'تم حصول على بيانات صفحة   مترجمة بنجاح ' ,
    'PAGE_TRANSLATED_FAILED' => ' تعذر حصول على بيانات صفحة   مترجمة بنجاح ' ,
    'CREATE_SUCCESS' => 'تم الإنشاء بنجاح',
    'CREATE_FAILED' => 'فشل في الإنشاء، حاول مرة أخرى',
    'ERROR_OCCURRED' => 'حدث خطأ' ,
    'DELETE_SUCCESS' => 'تم الحذف بنجاح',
    'DELETE_FAILED' => 'فشل في الحذف، حاول مرة أخرى',
    'UPDATE_FCM_TOKEN_SUCCESSFULLY'=> 'تم تحديث رمز الجهاز بنجاح',
    'REQUEST_SUCCESS' => 'تمت العملية بنجاح',
    'UPDATE_SUCCESS' => 'تم التحديث بنجاح',
    'UPDATE_FAILED' => 'فشل في التحديث، حاول مرة أخرى',
    'CURL_ERROR' => 'خطأ في curl' ,
    'favorite' => 'تمت الإضافة إلى قائمتك المفضلة',
    'favorite_delete' => 'تم الحذف من قائمتك المفضلة',
    'PASSWORD_changed' => 'تم تغيير كلمة المرور بنجاح',
    'NO_ACCESS_PERMISSION' => 'ليس لديك صلاحية الوصول إلى هذا المكون',
    'NOT_FOUND' => 'العنصر غير موجود',
    'REORDER_SUCCESS' => 'تم إعادة ترتيب الطلب بنجاح',
    //  ORDERS
    'RESTORE_SUCCESS' => 'RESTORE_SUCCESS',

    'ORDER_NOT_FOUND' => ' لم يتم العثور على الطلبية ',
    'ORDER_DETAILS_RETRIEVED' => 'تم استرداد تفاصيل الطلب' ,
    'USER_NOT_FOUND' => 'لم يتم العثور على المستخدم ' ,
    'USER_DELETE_SUCCESS' => ' تم حذف حساب المستخدم بنجاح ' ,
    'SEND' => 'تم ارسال الرسالة ',

    'NOTAUTHORIZED' =>  'غير مصرح لك  يجب عليك تسجيل دخول اولا ',
    'UPDATE_CHATTING_INFO' =>  'تم تحديث بيانات الجلسة بنجاح' ,
    // Order Status
    'PENDING' => 'تم إنشاء طلبك بنجاح',
    'ACCEPTED' => 'تم قبول طلبك من قبل الموزع:',
    'DECLINED' => 'عذرًا، تم رفض طلبك من قبل الموزع:',
    'ONWAY' => 'الموزع في طريقه إليك',
    'PROCESSING' => 'طلبك قيد التجهيز',
    'FILLED' => 'تم تجهيز طلبك',
    'DELIVERED' => 'تم تسليم طلبك، الرجاء تأكيد التسليم',
    'COMPLETED' => 'نحن هنا لخدمتك',
    'CANCELLED_BY_VENDOR' => 'نعتذر، تم إلغاء طلبك من قبل الموزع:',
    'CANCELLED_BY_CUSTOMER' => 'تم رفض الطلب من قبل العميل:',

    'CREATE_USERS_ACCOUNT' => 'تم إنشاء الحساب بنجاح',

    'password.required' => 'كلمة المرور مطلوبة.',
    'password.string' => 'كلمة المرور يجب أن تكون نصًا.',
    'password.min' => 'كلمة المرور يجب أن تكون على الأقل :min أحرف.',
    'password.confirmed' => 'تأكيد كلمة المرور غير مطابق.',

    // رسائل الصيدلية (pharmacy)
    'name_pharmacy.required' => 'اسم الصيدلية مطلوب.',
    'name_pharmacy.string' => 'اسم الصيدلية يجب أن يكون نصًا.',
    'name_pharmacy.max' => 'اسم الصيدلية لا يجب أن يتجاوز 255 حرفًا.',

    'image_pharmacy.required' => 'صورة الصيدلية مطلوبة.',
    'image_pharmacy.image' => 'الصورة يجب أن تكون من نوع صورة (jpg أو png أو jpeg).',

    'license_number.required' => 'رقم الترخيص مطلوب.',
    'license_number.unique' => 'رقم الترخيص مستخدم من قبل.',

    'license_file_path.required' => 'ملف الترخيص مطلوب.',
    'license_file_path.file' => 'ملف الترخيص يجب أن يكون ملفًا صحيحًا.',

    'license_expiry_date.required' => 'تاريخ انتهاء الترخيص مطلوب.',
    'license_expiry_date.date' => 'تاريخ انتهاء الترخيص يجب أن يكون تاريخًا صحيحًا.',

    'phone_number_pharmacy.required' => 'رقم هاتف الصيدلية مطلوب.',
    'phone_number_pharmacy.string' => 'رقم الهاتف يجب أن يكون نصًا.',
    'phone_number_pharmacy.max' => 'رقم الهاتف لا يجب أن يتجاوز 20 رقمًا.',
    'phone_number_pharmacy.unique' => 'رقم الهاتف مستخدم من قبل.',

    'email_pharmacy.required' => 'البريد الإلكتروني للصيدلية مطلوب.',
    'email_pharmacy.email' => 'صيغة البريد الإلكتروني للصيدلية غير صحيحة.',
    'email_pharmacy.unique' => 'صيغة البريد الإلكتروني مستخدم من قبل.',

    'status_exist.required' => 'حالة وجود الصيدلية مطلوبة.',
    'status_exist.in' => 'القيمة المدخلة لحالة الوجود غير صحيحة. يجب أن تكون "open" أو "closed".',


    'working_hours.required' => 'ساعات العمل مطلوبة.',
    'working_hours.string' => 'ساعات العمل يجب أن تكون نصًا.',



    'TOKEN_VALID' => 'الرمز صالح ' ,
//    'NO_DATA' => ' لا يوجد بيانات ' ,
//    'name' => [
//        'required' => 'حقل اسم مطلوب.',
//        'string' => 'حقل الاسم يجب أن يكون نصًا.',
//        'max' => 'لا يمكن أن يتجاوز  عدد المستخدين  4 .',
//
//    ],
//    'members' => [
//        'required' => 'حقل اسم مطلوب.',
//        'string' => 'يجب أن يكون رقم الهاتف نصًا.',
//        'max' => 'لا يمكن أن يتجاوزعدد المستخدمين    4  .',
//        'min' => 'لا يمكن أن يتجاوز عدد المستخدمي    2  .',
//
//    ],
//         'exists' => 'المسخدمين التي تم ارفاقهم غير موجودين ',
//
//    'name_game' => [
//        'required' => 'حقل اسم اللعبة مطلوب.',
//        'max' => 'يجب ان يكون حجم الاسم اقل من 255 حرف '
//     ],
//    'challenge_id' => [
//        'required' => 'رقم التحدي مطلوب.',
//        'integer' => 'رقم التحدي يجب أن يكون عدد صحيح.',
//        'exists' => 'رقم التحدي المحدد غير صالح.',
//    ],

    'first_competitor_id' => [
        'required' => 'رقم المتسابق الأول مطلوب.',
        'integer' => 'رقم المتسابق الأول يجب أن يكون عدد صحيح.',
        'exists' => 'رقم المتسابق الأول المحدد غير صالح.',
    ],

    'second_competitor_id' => [
        'required' => 'رقم المتسابق الثاني مطلوب.',
        'integer' => 'رقم المتسابق الثاني يجب أن يكون عدد صحيح.',
        'exists' => 'رقم المتسابق الثاني المحدد غير صالح.',
    ],
    'type_game' => [
        'required' =>'يجب إدخال حقل نوع اللعبة.' ,
        'in' => 'يجب تحديد طبيعة التحدي، سواء كان  فرديًا ادخل (I) أو فريقًا  ادخل (T).',
    ],
    'winner_id' => [
        'required' => 'رقم الفائز مطلوب.',
        'integer' => 'رقم الفائز يجب أن يكون عدد صحيح.',
        'exists' => 'رقم الفائز المحدد غير صالح.',
    ],

    'score_FC' => [
        'required' => 'النتيجة للمتسابق الاول مطلوبة.',
        'integer' => 'النتيجة للمتسابق  الاول يجب أن تكون عدد صحيح.',
        'max' => 'النتيجة للمتسابق الاول  يجب ألا تتجاوز :max.',
    ],

    'score_SC' => [
        'required' => 'النتيجة للمتسابق الثاني  مطلوبة.',
        'integer' => 'النتيجة للمتسابق الثاني  يجب أن تكون عدد صحيح.',
        'max' => 'النتيجة للمتسابق الثاني  يجب ألا تتجاوز :max.',
    ],
    'categories_id' => [
        'required' => 'حقل نوع اللعبة مطلوب ' ,
        'integer' => 'يجب ان يكون نوع اللعبة المرجع رقم' ,
        'not_in' =>  'نوع اللعبة المرفق غير صحيح ' ,
        'array' => 'يجب ان يكون نوع اللعبة المرجع قائمة' ,
        'min' => 'يجب اختيار على اقل 8 فئات ' ,
        'exists' =>  'إحدى الفئات المحددة غير موجودة' ,
    ],
    'answer_text_ar.required' => 'حقل نص الاجابة مطلوب' ,
    'blocked_Admin' => 'تم حظر حسابك من قبل المشرف',
    'categories_id.*.exists' => 'إحدى الفئات المحددة غير موجودة' ,
    'categories_id.*.required' => 'كل معرف في القائمة مطلوب',
    'categories_id.*.integer' => 'كل معرف يجب أن يكون رقمًا صحيحًا',

    'difficulty_level_update.required' =>  'يجب علي تحديد مستوى صعوبة السؤال' ,
    'difficulty_level.required' =>  'يجب علي تحديد مستوى صعوبة السؤال' ,


    'user1_id' => [
        'required' =>  'قيمة منشا اللعبة مطلوب ' ,
        'integer' =>   'مرجع حقل منشأ يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنشأ غير موجود '
    ],

    'team_member1_id' => [
        'required' =>  'قيمة فريق المنافس الاول مطلوب ' ,
        'integer' =>   'مرجع حقل الفريق المنافس الاول  يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنافس الاول   غير موجود '
    ],
    'team_member2_id' => [
        'required' =>  'قيمة فريق المنافس الثاني مطلوب ' ,
        'integer' =>   'مرجع حقل الفريق المنافس الثاني  يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنافس الثاني  غير موجود '
    ],

    'members' => [
        'exists' =>  'القيمة المرجعة من المستخدم غير موجود '
    ],
      'user2_id' => [
        'required' =>  'حقل المنافس مطلوب ' ,
        'integer' =>   'مرجع حقل منافس يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنافس غير موجود '
         ],
    'competition_over_competitor_notification_title' => 'المسابقة على وشك الانتهاء !' ,
    'competition_over_competitor_notification_body' => 'صديقك انتهى من اللعبة بقية القليل من وقت ' ,
    'invitation_accept_competitor_notification_title'=> 'التحدي قد بدا!' ,
    'invitation_accept_competitor_notification_body' => 'وافق على انضمام  لتحدي هيا بنا !' ,
    'invitation_notification_title' => 'منافسة جديدة !' ,
    'invitation_notification_body' => 'احمد قام بدعوتك لمنافسة في تطبيق جاوبنا هي بنا ! ' ,
    'accept_friend_request_notification_title' => 'تم قبول طلب الصداقة!' ,
    'accept_friend_request_notification_body' => ' قبل طلب الصداقة الخاص بك. قل مرحبًا وابدأ لعبة معًا!' ,
    'friend_request_notification_title' => 'طلب الصداقة' ,
    'friend_request_notification_body' => 'أرسل لك طلب صداقة ' ,
    'sender_id.required' => 'حقل الاسم مطلوب.',
    'sender_id.exists' => ' رقم معرف غير موجود',
    'receiver_id.required' => 'حقل الاسم مطلوب.',
    'receiver_id.exists' => ' رقم معرف غير موجود',
    'id.exists' => 'الفئة المحددة ليست فئة أساسية صالحة.',
    'id.required' => 'حقل المعرف  مطلوب.',
    'id.integer' => 'يجب ان يكون المعرف رقما ',
    'id_not_found' => 'حدث خطأ:عنصر  غير موجود  ' ,
    'friend_request_exists' =>'لقد قمت بارسال طلب الصداقة مسبقا!' ,
    'invalid_credentials' => 'كلمة المرور او الايميل غير صالحين ' ,
    'title.required' => 'حقل عنوان مطلوب.',
    'title.string' => 'يجب أن يكون الاسم نصًا.',
    'title.max' => 'لا يمكن أن يتجاوز طول الاسم 255 حرفًا.',
    'new_consultation_notify' => 'تم استلام طلب استشارة جديد من المريض :name',
    'description.required' => 'حقل تفاصيل مطلوب.',
    'description.string' => 'يجب أن يكون تفاصيل نصًا.',

    'full_name.required' => 'حقل الاسم الكامل مطلوب.',
    'full_name.string' => 'يجب أن يكون الاسم الكامل نصًا.',
    'full_name.max' => 'لا يمكن أن يتجاوز طول الاسم الكامل 255 حرفًا.',

    'email.required' => 'حقل البريد الإلكتروني مطلوب.',
    'email.string' => 'يجب أن يكون البريد الإلكتروني نصًا.',
    'email.email' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    'email.max' => 'لا يمكن أن يتجاوز طول البريد الإلكتروني 255 حرفًا.',
    'email.unique' => 'البريد الإلكتروني مستخدم بالفعل.',

    'phone.required' => 'حقل رقم الهاتف مطلوب.',
    'phone.string' => 'يجب أن يكون رقم الهاتف نصًا.',
    'phone.unique' => 'رقم الهاتف مستخدم بالفعل.',
    'phone.prefix' => 'يجب أن يحتوي رقم الجوال على مقدمة الدولة :prefix ويتكون من 9 إلى 14 رقماً.',
    'password' => [
        'required' => 'حقل كلمة المرور مطلوب.',
        'string' => 'يجب أن تكون كلمة المرور عبارة عن سلسلة.',
        'min' => 'يجب أن تكون كلمة المرور على الأقل :min حرفًا.',
        'confirmed' => 'تأكيد كلمة المرور غير متطابق.',
        'letters' => 'يجب أن تحتوي كلمة المرور على حرف واحد على الأقل.',
        'mixed_case' => 'يجب أن تحتوي كلمة المرور على أحرف كبيرة وصغيرة.',
        'numbers' => 'يجب أن تحتوي كلمة المرور على رقم واحد على الأقل.',
        'symbols' => 'يجب أن تحتوي كلمة المرور على رمز واحد على الأقل.',
        'uncompromised' => 'ظهرت كلمة المرور المقدمة في خرق للبيانات. يرجى اختيار كلمة مرور مختلفة.',
    ],
    'email' => [
        'required' => 'البريد الإلكتروني مطلوب.',
        'email' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    ],
    'country' => [
        'required' => 'الدولة مطلوب',
    ] ,
    'phone' => [
        'required' => 'رقم الهاتف مطلوب.',
        'mobile_number' => 'رقم الهاتف يحتاج إلى بادئة'
    ],
    'verification_method' => [
        'required' => 'طريقة التحقق مطلوبة.',
        'in' => 'يجب أن تكون طريقة التحقق إما عبر البريد الإلكتروني أو الهاتف.',
    ],
    'name_ar' => [
        'required' => 'اسم اللعبة باللغة العربية مطلوب.',
        'string' => 'اسم اللعبة باللغة العربية يجب أن يكون نصاً.',
        'unique' => 'اسم اللعبة باللغة العربية موجود بالفعل.',
        'max' => 'اسم اللعبة باللغة العربية يجب ألا يتجاوز 255 حرفاً.',
    ],

    'name_en' => [
        'required' => 'اسم اللعبة باللغة العربية مطلوب.',
        'string' => 'اسم اللعبة باللغة العربية يجب أن يكون نصاً.',
        'unique' => 'اسم اللعبة باللغة العربية موجود بالفعل.',
        'max' => 'اسم اللعبة باللغة العربية يجب ألا يتجاوز 255 حرفاً.',
    ],




    'description_ar' => [
        'required' => 'الوصف باللغة العربية مطلوب.',
        'string' => 'الوصف باللغة العربية يجب أن يكون نصاً.',
        'max' => 'الوصف باللغة العربية يجب ألا يتجاوز 255 حرفاً.',
    ],
    'description_en' => [
        'required' => 'الوصف باللغة العربية مطلوب.',
        'string' => 'الوصف باللغة العربية يجب أن يكون نصاً.',
        'max' => 'الوصف باللغة العربية يجب ألا يتجاوز 255 حرفاً.',
    ],



    'rating' => [
        'required' => 'التقييم مطلوب.',
        'numeric' => 'التقييم يجب أن يكون رقماً.',
        'min' => 'التقييم يجب أن يكون أكبر من أو يساوي 0.',
        'max' => 'التقييم يجب أن يكون أقل من أو يساوي 5.',
    ],



    'parent_id' => [
        'integer' => 'المعرف الأب يجب أن يكون رقماً صحيحاً.',
        'min' => 'المعرف الأب يجب أن يكون أكبر من أو يساوي 0.',
        'exists' => 'المعرف الأب غير موجود.',
    ],

    'famous_gaming' => [
        'boolean' => 'الخاصية يجب أن تكون قيمة منطقية (صحيح/خطأ).',
    ],
    'question_ar_text' => [
        'required' => 'نص السؤال باللغة العربية مطلوب.',
        'string' => 'يجب أن يكون نص السؤال باللغة العربية نصًا.',
        'unique' => 'يجب أن يكون نص السؤال باللغة العربية فريدًا.',
        'max' => 'يجب ألا يتجاوز نص السؤال باللغة العربية 255 حرفًا.',
    ],
    'question_en_text' => [
        'required' => 'نص السؤال باللغة الإنجليزية مطلوب.',
        'string' => 'يجب أن يكون نص السؤال باللغة الإنجليزية نصًا.',
        'unique' => 'يجب أن يكون نص السؤال باللغة الإنجليزية فريدًا.',
        'max' => 'يجب ألا يتجاوز نص السؤال باللغة الإنجليزية 255 حرفًا.',
    ],

    'consultant_account'=>'معرف المستشار المحدد لا يتطابق مع نوع المستشار.',
    'patient_account'=>'معرف المريض المحدد لا يتطابق مع نوع المريض.',
    'duplicate_request'=>'لقد قمت بإرسال هذا الطلب مسبقًا، يرجى انتظار القبول.',
    'ACCEPTED_REQUEST'=> ' تم قبول طلب الاستشارة من قبل المستشار  :name',
    'CANCEL_REQUEST_PATIENT' => 'تم إلغاء طلب الاستشارة من قبل المريض :name',
    'CANCEL_REQUEST' => 'تم إلغاء طلب الاستشارة   ',
    'CANCEL_REQUEST_CONSULTANT' => 'تم إلغاء طلب الاستشارة من قبل الدكتور :name',
    'NOT_APPROVED'=>'لم يتم اعتماد برنامجك بعد ',
    'SUCCESS_PUBLISHED'=>'تم  نشر برنامجك بنجاح ',
    'PROGRAM_NOT_FOUND'=>'لم يتم العثور على البرنامج',
    'VIDEO_NOT_FOUND'=>'لم يتم العثور على الفيديو',
    'SESSION_COMPLETED_BOTH' => 'تم اكتمال جلسة الاستشارة بين :patient و :consultant بنجاح، شكرًا لتفاعلكم.',


];
