<?php

return [
    'consultation' => [
        'pay' => [
            'not_patient'      => 'فقط المرضى يمكنهم الدفع على الاستشارة.',
            'not_owner'        => 'لا يمكنك الدفع على استشارة لا تخصك.',
            'already_paid'     => 'هذه الاستشارة مدفوعة مسبقاً.',
        ],
        'create_request' => [
            'not_approved'     => 'حساب المستشار  لم يتم اعتماده بعد.',
            'not_active'       => 'حساب المستشار غير نشط، حاول مرة اخرى مع مستشار اخر.',
        ],
        'view' => [
            'unauthorized'     => 'ليس لديك صلاحية لعرض هذه الاستشارة.',
        ],
        'policy_not_found' => 'ليس لديك صلاحية للقيام بهذا الإجراء.',
        'dispute' =>
         [
            'not_owner' => 'هذه الاستشارة لا تعود لك، لذلك لا يمكنك فتح نزاع عليها.' ,
            'not_review_window' => 'يمكن فتح النزاع فقط خلال فترة المراجعة.' ,
            'expired' => 'انتهت فترة المراجعة لهذه الاستشارة.'
         ] ,
        'accept' => [
            'not_consultant'     => 'فقط المستشار المعني يمكنه قبول الاستشارة.',
            'not_paid'           => 'لا يمكن قبول استشارة لم يتم دفعها.',
            'appointment_passed' => 'لا يمكن قبول الاستشارة لأن موعدها قد مضى.',
        ],
        'cancel' => [
            'wrong_role' => "ليس لديك صلاحية إلغاء هذه الاستشارة."
        ]
    ],
];
