<?php

return [
    'consultation' => [
        'pay' => [
            'not_patient'      => 'فقط المرضى يمكنهم الدفع على الاستشارة.',
            'not_owner'        => 'لا يمكنك الدفع على استشارة لا تخصك.',
            'already_paid'     => 'هذه الاستشارة مدفوعة مسبقاً.',
        ],
        'create_request' => [
            'not_approved'     => 'حساب المستشار  لم يتم اعتماده بعد.',
            'not_active'       => 'حساب المستشار غير نشط، حاول مرة اخرى مع مستشار اخر.',
        ],
        'view' => [
            'unauthorized'     => 'ليس لديك صلاحية لعرض هذه الاستشارة.',
        ],
        'policy_not_found' => 'ليس لديك صلاحية للقيام بهذا الإجراء.'
    ],
];
